{
  "memorial_url": "https://www.findagrave.com/memorial/237781742/gerald-robert-gaiser",
  "name": "Gerald Robert “Gerry” Gaiser",
  "birth_date": "1937-00-00",
  "death_date": "2022-03-17",
  "cemetery": "Crediton Cemetery",
  "location": "Crediton",
  "part_bio": "GAISER, GeraldPeacefully, at Stratford General Hospital, Stratford, on Thursday, March 17, 2022, Gerald \"Gerry\" Robert Gaiser, of Exeter Villa, formerly of Crediton, age 85. Loved father and father-in-law of Brian \"Skweeze\" and Dianne Gaiser, Scott Gaiser and Carrie Noyes all of Crediton and the mother of his children Dorothy (Jaques) Gaiser of Exeter. Cherished grandpa of Nicholas Gaiser, Michael Gaiser and Liz, Caitlin and Jim Mills and Royal Gaiser. Treasured great-grandpa of James Mills. Dear brother of Shirley Hutchinson of Lucan. Fondly remembered by his dear friend Joanne Price of Huron Park and his nieces, nephews, Dorothy's siblings and their families. Predeceased by his parents Royal Vernon and Kathleen Wilhelmina (Morlock) Gaiser, infant son David Jeffery, siblings and in-laws Aubrey and Betty Gaiser, Gord Hutchinson and Grace and Bob Pfaff. At Gerald's request, cremation has taken place. A Memorial Service will be held at the T. Harry Hoffman & Sons Funeral Home, Dashwood on Wednesday, March 23, 2022 at 2 p.m. with visitation from 1 to 2 p.m. Mr. Bob Heywood Officiant. Face masks optional. Family interment will take place at Crediton Cemetery",
  "bio": "GAISER, Gerald<br/><br/>Peacefully, at Stratford General Hospital, Stratford, on Thursday, March 17, 2022, Gerald \"Gerry\" Robert Gaiser, of Exeter Villa, formerly of Crediton, age 85. Loved father and father-in-law of Brian \"Skweeze\" and Dianne Gaiser, Scott Gaiser and Carrie Noyes all of Crediton and the mother of his children Dorothy (Jaques) Gaiser of Exeter. Cherished grandpa of Nicholas Gaiser, Michael Gaiser and Liz, Caitlin and Jim Mills and Royal Gaiser. Treasured great-grandpa of James Mills. Dear brother of Shirley Hutchinson of Lucan. Fondly remembered by his dear friend Joanne Price of Huron Park and his nieces, nephews, Dorothy's siblings and their families. <br/><br/>Predeceased by his parents Royal Vernon and Kathleen Wilhelmina (Morlock) Gaiser, infant son David Jeffery, siblings and in-laws Aubrey and Betty Gaiser, Gord Hutchinson and Grace and Bob Pfaff. <br/><br/>At Gerald's request, cremation has taken place. A Memorial Service will be held at the T. Harry Hoffman &amp; Sons Funeral Home, Dashwood on Wednesday, March 23, 2022 at 2 p.m. with visitation from 1 to 2 p.m. Mr. Bob Heywood Officiant. Face masks optional. Family interment will take place at Crediton Cemetery",
  "gps": null,
  "image_url": "https://images.findagrave.com/photos/2023/216/237781742_dc17add1-e1de-47ef-9564-319618c278af.jpeg?size=photos250",
  "image_credits": "Slick",
  "image_credits_url": "/user/profile/50973252",
  "parents": [],
  "spouses": [],
  "children": [],
  "siblings": "[]",
  "half_siblings": [],
  "plot_value": "",
  "title": "",
  "prefix": "",
  "photos": "[]",
  "maiden_name": "",
  "inscription": "",
  "id": 400
}