{
  "memorial_url": "https://www.findagrave.com/memorial/52082649/james-alan-lovie",
  "name": "James Alan Lovie",
  "birth_date": "1963-10-14",
  "death_date": "2010-04-26",
  "cemetery": "Crediton Cemetery",
  "location": "Crediton",
  "part_bio": "LOVIE: Peacefully, after a valiant struggle, surrounded by the love of his family, at South Huron Hospital, Exeter, Monday, April 26, 2010, James \"Jim\" Alan Lovie, of Shipka, RR 2, Dashwood, age 46. Cherished husband and best friend of Catherine (Lynn) Lovie. Loving father of Matt (friend Laura Bennett), Mike (friend Breanne Baird) and Emily all at home. Dear son of Verna Ilene (Bullock) Lovie of Grand Bend, and the late Carman Chester Lovie (2009). Loved brother and brother-in-law of Ken and Barb Lovie of Shipka, Larry and Donna Lovie, Stan and Cass Lovie all of RR 3, Parkhill, Bob and Nancy-Rae Lovie of Grand Bend, Randy and Susan Lovie of RR 2, Zurich and JoAnne Lovie of Brantford, Cheryl and John Cook of RR 3, Granton, Bonnie and Richard Vandenberk of RR 3, Parkhill, Gerry and Vicki Lynn of RR 2, Lucan. Dearly loved son-in-law of Gerald and Irene Lynn of RR 2, Lucan. Special uncle to his many nieces, nephews and their families. Jim proudly followed his father's (Carman Lovie) footsteps in construction with his brothers and later formed Jim Lovie Carpentry, where his sons worked by his side in the summers. He was also a director of Hay Mutual Insurance Company for the past 8 years. Jim was a proud serving volunteer firefighter for 26 years with the Grand Bend Fire Department. He enjoyed being involved with the community, coaching South Huron Minor Hockey and Crediton Minor Ball Association for many years. Jim was a sportsman, hunting and fishing at Kerr Lake Camp on Manitoulin Island, where he was a part owner between brothers and friends, which was his favourite pastime. Resting at the T. Harry Hoffman & Sons Funeral Home, Dashwood, with visitation Thursday from 2 to 4 p.m. and 7 to 9 p.m. A Fireman's Walk Thru will take place at the Funeral Home Thursday at 6:30 p.m. The Funeral Service will be held at Zion United Church, Crediton, Friday, April 30, 2010 at 12 noon. The Rev. Darrell Shaule officiating. Interment Crediton Cemetery. If desired, memorial donations to the Lovie Kid's Education Trust Fund, South Huron Hospital Foundation, Cancer Society or charity of your choice would be appreciated.",
  "bio": "James Alan Lovie<br/>October 14 1963- April 26 2010<br/>BEST FRIEND AND HUSBAND OF<br/>CATHERINE ANNE(LYNNE)<br/>PROUD AND LOVING PARENTS OF<br/>MATTHEW, MICHAEL AND EMILY<br/><br/>YOUR SMILE AND LOVE LIT UP OUR LIVES ON EARTH<br/>YOUR SOUL NOW LIGHTS UP HEAVEN<br/>",
  "gps": {
    "latitude": "43.2996861",
    "longitude": "-81.5528944"
  },
  "image_url": "https://images.findagrave.com/photos/2018/209/52082649_52b59e80-3613-4eba-a693-90b21e31f30a.jpeg?size=photos250",
  "image_credits": "rossddickson",
  "image_credits_url": "/user/profile/49188008",
  "parents": [
    {
      "name": "Carman Chester   Lovie",
      "birth_date": "1917-00-00",
      "death_date": "2009-00-00",
      "profile_url": "/memorial/38371444/carman_chester-lovie"
    },
    {
      "name": "Verna Ilene  Bullock Lovie",
      "birth_date": "1922-00-00",
      "death_date": "2011-00-00",
      "profile_url": "/memorial/67025144/verna_ilene-lovie"
    }
  ],
  "spouses": [],
  "children": "[]",
  "siblings": "[{\"name\": \"Kenneth John \\\"Ken\\\"  Lovie\", \"birth_date\": \"1941-00-00\", \"death_date\": \"2017-00-00\", \"profile_url\": \"/memorial/175104520/kenneth_john-lovie\"}, {\"name\": \"Stanley Wayne   Lovie\", \"birth_date\": \"1945-00-00\", \"death_date\": \"2014-00-00\", \"profile_url\": \"/memorial/155850898/stanley_wayne-lovie\"}]",
  "half_siblings": "[]",
  "plot_value": "",
  "title": "",
  "prefix": "",
  "photos": "[]",
  "maiden_name": "",
  "inscription": "James Alan LovieOctober 14 1963- April 26 2010BEST FRIEND AND HUSBAND OFCATHERINE ANNE(LYNNE)PROUD AND LOVING PARENTS OFMATTHEW, MICHAEL AND EMILYYOUR SMILE AND LOVE LIT UP OUR LIVES ON EARTHYOUR SOUL NOW LIGHTS UP HEAVEN",
  "id": 682
}