{
  "memorial_url": "https://www.findagrave.com/memorial/163953310/olive-ila-ratz",
  "name": "Olive Ila Dinsdale Ratz",
  "birth_date": "1922-00-00",
  "death_date": "2014-08-02",
  "cemetery": "Crediton Cemetery",
  "location": "Crediton",
  "part_bio": "Beloved wife of the late Earl William Ratz (1999). Loved mother of David “Dave” Ratz of RR 2, Dashwood and dear friend Cathy Pickering and Judy Deichert of London. Loving grandma of Dave (Jr) and Nicole “Nikki” Ratz of Whitby and great-grandma of Kaylee. Mark Deichert and Tya Lothi of London and her daughter Lillia. Paul Deichert and Meredith Brown of Stratford and great-grandma of William and Maeve. Remembered by her many nephews and their families. Predeceased by her parents Arthur and Elizabeth “Bessie” Dinsdale, sister Gertrude Jacquith, husband Jim, previous husband Harvey Stokes and nephew John Stokes. Olive was a long time and active member of the Grand Bend United Church and of the Shipka Community.",
  "bio": "Beloved wife of the late Earl William Ratz (1999). Loved mother of David “Dave” Ratz of RR 2, Dashwood and dear friend Cathy Pickering and Judy Deichert of London. Loving grandma of Dave (Jr) and Nicole “Nikki” Ratz of Whitby and great-grandma of Kaylee. Mark Deichert and Tya Lothi of London and her daughter Lillia. Paul Deichert and Meredith Brown of Stratford and great-grandma of William and Maeve. Remembered by her many nephews and their families. Predeceased by her parents Arthur and Elizabeth “Bessie” Dinsdale, sister Gertrude Jacquith, husband Jim, previous husband Harvey Stokes and nephew John Stokes. <br/><br/>Olive was a long time and active member of the Grand Bend United Church and of the Shipka Community.<br/>",
  "gps": null,
  "image_url": "https://images.findagrave.com/photos/2016/156/163953310_1465171698.jpg?size=photos250",
  "image_credits": "BWin",
  "image_credits_url": "/user/profile/48483226",
  "parents": [],
  "spouses": [
    {
      "name": "Earl W.   Ratz",
      "birth_date": "1914-00-00",
      "death_date": "1999-00-00",
      "profile_url": "/memorial/188136478/earl_w-ratz",
      "image_url": "https://images.findagrave.com/photos/2022/86/188136478_890dfc55-6e49-40d6-be29-a39ec283adff.jpeg?size=photos250",
      "id": 861
    }
  ],
  "children": "[]",
  "siblings": "[]",
  "half_siblings": "[]",
  "plot_value": "",
  "title": "",
  "prefix": "",
  "photos": "[]",
  "maiden_name": "Dinsdale",
  "inscription": "",
  "id": 878,
  "slug": "olive-ila-dinsdale-ratz-878"
}