{
  "memorial_url": "https://www.findagrave.com/memorial/206780551/margaret-mary-barrett",
  "name": "Margaret Mary “Peggy” Noonan Barrett",
  "birth_date": "1929-05-23",
  "death_date": "2019-02-02",
  "cemetery": "Crediton Cemetery",
  "location": "Crediton",
  "part_bio": "All Her loving children Patsy and Joe, Kevin and Pauline, and Joe and the grandchildren and great-grandchildren are saddened to announce the passing of their matriarch at rural South Huron Hospital, Exeter on Saturday, February 2, 2019 formerly of London in her 90th year.Beloved wife of the late Joseph Francis Barrett (2012).All her grandchildren and great-grandchildren will deeply miss their \"Nanny\".A private family service was held at the Haskett Funeral Home with The Rev. Father Len Desjardins officiating. Cremation followed by interment Crediton Cemetery. The family would like to extend their deepest gratitude Dr. Shu, ACE geriatrics trained doctor from Mount Sinai Hospital, Toronto, for her continued support, great care, and going the extra mile as their mother's home services were reduced. A special thank you to Matthew and his colleagues in the emergency room, short stay and medicine departments at LHSC – Victoria Hospital for going above and beyond. If desired, donations to LHSC Foundation would be appreciated by the family.Contributor: 49867182-suggested corrections to name, birth date, date of marriage.",
  "bio": "All Her loving children Patsy and Joe, Kevin and Pauline, and Joe and the grandchildren and great-grandchildren are saddened to announce the passing of their matriarch at rural South Huron Hospital, Exeter on Saturday, February 2, 2019 formerly of London in her 90th year.<br/><br/>Beloved wife of the late Joseph Francis Barrett (2012).<br/>All her grandchildren and great-grandchildren will deeply miss their \"Nanny\".<br/><br/>A private family service was held at the Haskett Funeral Home with The Rev. Father Len Desjardins officiating. Cremation followed by interment Crediton Cemetery. <br/><br/>The family would like to extend their deepest gratitude Dr. Shu, ACE geriatrics trained doctor from Mount Sinai Hospital, Toronto, for her continued support, great care, and going the extra mile as their mother's home services were reduced.<br/> A special thank you to Matthew and his colleagues in the emergency room, short stay and medicine departments at LHSC – Victoria Hospital for going above and beyond.<br/><br/> If desired, donations to LHSC Foundation would be appreciated by the family.<br/><br/>Contributor: 49867182-suggested corrections to name, birth date, date of marriage.",
  "gps": null,
  "image_url": "https://images.findagrave.com/photos/2022/84/206780551_8e6e462a-b592-4874-843d-66ae2e4c9b8e.jpeg?size=photos250",
  "image_credits": "patricia van horn",
  "image_credits_url": "/user/profile/49867182",
  "parents": [],
  "spouses": [
    {
      "name": "Joseph Francis   Barrett",
      "birth_date": "1932-00-00",
      "death_date": "2012-00-00",
      "profile_url": "/memorial/164498762/joseph_francis-barrett",
      "image_url": "https://images.findagrave.com/photos/2016/162/164498762_1465689477.jpg?size=photos250",
      "id": 10
    }
  ],
  "children": [],
  "siblings": "[]",
  "half_siblings": [],
  "plot_value": "",
  "title": "",
  "prefix": "",
  "photos": "[]",
  "maiden_name": "Noonan",
  "inscription": "",
  "id": 11,
  "slug": "margaret-mary-peggy-noonan-barrett-11"
}