{
  "memorial_url": "https://www.findagrave.com/memorial/263117529/dolores-fuller",
  "name": "Dolores “Lossy” Schenk Fuller",
  "birth_date": "1932-00-00",
  "death_date": "2023-12-25",
  "cemetery": "Crediton Cemetery",
  "location": "Crediton",
  "part_bio": "FULLER: Dolores \"Lossy\" (Schenk) of ExeterDECEMBER 28, 2023 BY HASKETT FUNERAL HOMESFULLER: Dolores \"Lossy\" (Schenk) of ExeterPeacefully on her favourite day of the year, December 25, 2023 at Blue Water Rest Home, Zurich at the age of 91. Beloved wife of the late Jack Fuller (2000). Loving mother of Launa and Ken Leigh of Vancouver BC, Gail and Brad Murray of Exeter, Cathy Fuller of London, and Jeff Fuller of Goodwood. Adored grandmother of Cam and Cheryl, Shawn and Katie; Jennifer and Ryan, Jodi, Jordan and Amber; Samantha and Corey, and Melanie and Tyler. Proud great-grandmother of Harlow, Bo, Emma, Hayden, Taylor, Ryan, Hailey, Aurora, and Atticus. Fondly remembered by Judie Bowerbank. Dear sister-in-law of Marg Fuller.Lossy's love for her family, friends and community was undeniable, she cherished each moment spent with them. She was recognized for her achievements as an elected official, community advocate and volunteer throughout Huron County. She always said there is something rewarding when you Serve your community.Lossy's family would like to extend a sincere thank you to all staff at the Blue Water Rest Home for the compassionate and loving care they provided their mother over the past year. She called Blue Water her home.There will be a celebration of Lossy's life at Haskett Funeral Home, 456 Main Street, South, EXETER on Sunday, January 7th from 2-4 PM. Cremation with family interment in Crediton Cemetery.Donations to South Huron Hospital Foundation or Jessica's House would be appreciated by the family.",
  "bio": "Aged 91 years",
  "gps": null,
  "image_url": "https://images.findagrave.com/photos/2024/16/263117529_77bb006e-caa1-4e7e-9203-14875edd0b9a.jpeg?size=photos250",
  "image_credits": "patricia van horn",
  "image_credits_url": "/user/profile/49867182",
  "parents": [],
  "spouses": [],
  "children": [],
  "siblings": "[]",
  "half_siblings": [],
  "plot_value": "",
  "title": "",
  "prefix": "",
  "photos": "[]",
  "maiden_name": "Schenk",
  "inscription": "Aged 91 years",
  "id": 384
}