{
  "memorial_url": "https://www.findagrave.com/memorial/164207142/gerald-ross-haugh",
  "name": "Gerald Ross Haugh",
  "birth_date": "1926-00-00",
  "death_date": "2013-10-19",
  "cemetery": "Crediton Cemetery",
  "location": "Crediton",
  "part_bio": "Beloved husband of 62 years to Irene (Finkbeiner) Haugh of Exeter. Loved father and father-in-law of Linda (Brian) Nakamura of RR 2 Goderich and Dan Haugh (Leslie Smith) of London. Cherished grampa of Jason (Sarah) Nakamura, Laura Nakamura, Brent (Jenn) Haugh, Trevor (Kristiena) Haugh. Proud great-grampa of Mya, Carmen, Maggie, Nicholas, Landyn and Eva. Dear brother and brother-in-law of Lorne (Phyllis) Haugh of Exeter, Joyce (Michael) Burke of Brampton, Reg (Pauline) Finkbeiner of RR 2 Grand Bend, Dorothy Lambie of Saskatoon. Ross will also be missed by his daughter-in-law Sherri Haugh, many nieces, nephews and their families. Predeceased by his parents Milton and Clara (Weigand) Haugh, his brother-in-law Robert Lambie. Ross was a life long resident of Stephen Township. He was a faithful member of the Evangelical and United churches in Dashwood and Crediton all his life, and he held a number of positions in Zion Church in Crediton since the 1950’s, including Sunday School Superintendent, Chief Usher, Treasurer and Chairman of the Board of Stewards. An avid sports fan, especially of the Detroit Tigers and the Toronto Blue Jays. He coached minor baseball teams in Dashwood and was a respected baseball and softball umpire for many years doing as many as 100 games each year. Ross joined the staff of the Exeter Times Advocate in 1963 as a two-week replacement for the sports-editor. That turned into a long career as photographer-reporter-editor. There are not likely many people who grew up or lived in the South Huron area in the 60s, 70s or 80s whose picture he hasn’t taken. He was editor of the Huron Soil and Crop News for more than 25 years. The career that was intended to end in 1990, continued on a part-time basis as a summer and maternity replacement until 1997. He remained as author of the popular “Back In Time” column until 2010. Anyone who knew Ross will also remember his quick wit and love of a good joke. He would seldom let someone get away without leaving them with a story. Ross and Irene raised their family in Crediton where they lived for more than fifty years, before moving to Towerview Apartments in Exeter.",
  "bio": "Beloved husband of 62 years to Irene (Finkbeiner) Haugh of Exeter. Loved father and father-in-law of Linda (Brian) Nakamura of RR 2 Goderich and Dan Haugh (Leslie Smith) of London. Cherished grampa of Jason (Sarah) Nakamura, Laura Nakamura, Brent (Jenn) Haugh, Trevor (Kristiena) Haugh. Proud great-grampa of Mya, Carmen, Maggie, Nicholas, Landyn and Eva. Dear brother and brother-in-law of Lorne (Phyllis) Haugh of Exeter, Joyce (Michael) Burke of Brampton, Reg (Pauline) Finkbeiner of RR 2 Grand Bend, Dorothy Lambie of Saskatoon. Ross will also be missed by his daughter-in-law Sherri Haugh, many nieces, nephews and their families. Predeceased by his parents Milton and Clara (Weigand) Haugh, his brother-in-law Robert Lambie. <br/><br/>Ross was a life long resident of Stephen Township. He was a faithful member of the Evangelical and United churches in Dashwood and Crediton all his life, and he held a number of positions in Zion Church in Crediton since the 1950’s, including Sunday School Superintendent, Chief Usher, Treasurer and Chairman of the Board of Stewards. An avid sports fan, especially of the Detroit Tigers and the Toronto Blue Jays. He coached minor baseball teams in Dashwood and was a respected baseball and softball umpire for many years doing as many as 100 games each year. Ross joined the staff of the Exeter Times Advocate in 1963 as a two-week replacement for the sports-editor. That turned into a long career as photographer-reporter-editor. There are not likely many people who grew up or lived in the South Huron area in the 60s, 70s or 80s whose picture he hasn’t taken. He was editor of the Huron Soil and Crop News for more than 25 years. The career that was intended to end in 1990, continued on a part-time basis as a summer and maternity replacement until 1997. He remained as author of the popular “Back In Time” column until 2010. Anyone who knew Ross will also remember his quick wit and love of a good joke. He would seldom let someone get away without leaving them with a story. Ross and Irene raised their family in Crediton where they lived for more than fifty years, before moving to Towerview Apartments in Exeter.",
  "gps": null,
  "image_url": "https://images.findagrave.com/photos/2016/160/164207142_1465528565.jpg?size=photos250",
  "image_credits": "BWin",
  "image_credits_url": "/user/profile/48483226",
  "parents": [],
  "spouses": [
    {
      "name": "Mabel Irene  Finkbeiner Haugh",
      "birth_date": "1928-00-00",
      "death_date": "2015-00-00",
      "profile_url": "/memorial/163915897/mabel_irene-haugh",
      "image_url": "https://images.findagrave.com/photos/2016/155/163915897_1465096592.jpg?size=photos250"
    }
  ],
  "children": "[]",
  "siblings": "[]",
  "half_siblings": "[]",
  "plot_value": "",
  "title": "",
  "prefix": "",
  "photos": "[]",
  "maiden_name": "",
  "inscription": "",
  "id": 520
}