{
  "memorial_url": "https://www.findagrave.com/memorial/248067758/joan-marie-johnston",
  "name": "Joan Marie McCann Johnston",
  "birth_date": "1945-00-00",
  "death_date": "2022-10-29",
  "cemetery": "Crediton Cemetery",
  "location": "Crediton",
  "part_bio": "JOHNSTON: Joan Marie (née England) (McCann) of Wellesley formerly of CreditonOCTOBER 30, 2022 BY HASKETT FUNERAL HOMEJOHNSTON: Joan Marie (née England) (McCann) of Wellesley formerly of CreditonPassed away peacefully at Rotary Hospice, Stratford with her family by her side on Saturday, October 29, 2022 at the age of 77. Wife of the late Kenneth McCann. Cherished mother of Deric McCann of Hensall, and Wanda and Kevin Morden of Wellesley. Adored grandmother of Tysen McCann and Olivia Pache, Tayler McCann; Zachary Morden and Emily Morden. Dear sister and sister-in-law of Jackie Glavin-Daniels and Bill Daniels, Sandra and Keith Strang, Nancy and Bill Finkbeiner, and Bob and Elaine England. Fondly remembered by her many nieces, nephews and the extended England and McCann families. Predeceased by parents Pearl (Vannatter) and Jacque England.Joan nursed at South Huron Hospital and Kensington Village for many years.Cremation has taken place. A private family graveside will be held at the Crediton Cemetery at a later date. Arrangements entrusted to Haskett Funeral Home, Exeter (519-235-1220)Donations to Rotary Hospice – Stratford would be appreciated by the family.Offer Condolence for the family of JOHNSTON: Joan Marie (née England) (McCann) of Wellesley formerly of Crediton",
  "bio": "Aged 77 years",
  "gps": null,
  "image_url": "https://images.findagrave.com/photos/2023/4/248067758_4195647a-4124-4c8a-91d1-39dd511fb772.jpeg?size=photos250",
  "image_credits": "patricia van horn",
  "image_credits_url": "/user/profile/49867182",
  "parents": [],
  "spouses": [],
  "children": [],
  "siblings": [],
  "half_siblings": [],
  "plot_value": "",
  "title": "",
  "prefix": "",
  "photos": "[]",
  "maiden_name": "McCann",
  "inscription": "Aged 77 years",
  "id": 603
}